Конфигурация/Documents/ПереводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереводДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаПереводДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПереданныеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПеревода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПереводаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредствПолучатель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрокерПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыпискиПолучатель</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваНаличные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваНаличные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/Enums/ВариантыПереводаДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыПереводаДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводВПуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводИзПути</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыПереводовДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПереводовДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждуРасчетнымиСчетами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждуСчетамиБрокера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаявкеПайщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСчетаБрокераНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СРасчетногоСчетаНаСчетБрокера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзКассыНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СРасчетногоСчетаВКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждуКассами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПереводДенежныхСредств/Ext/ObjectModule.bsl
Функция ПолучитьВариантПереводаДенежныхСредств()
	
	Если      ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.ВПуть;
		
	ИначеЕсли ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.ИзПути;
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Основание) И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.ПоЗаявкеПайщика;
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Брокер) И ЗначениеЗаполнено(ЭтотОбъект.БрокерПолучатель) Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.МеждуСчетамиБрокера;
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Брокер) И Не ЗначениеЗаполнено(ЭтотОбъект.БрокерПолучатель) Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.СоСчетаБрокераНаРасчетныйСчет;
		
	ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект.Брокер) И ЗначениеЗаполнено(ЭтотОбъект.БрокерПолучатель) Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.СРасчетногоСчетаНаСчетБрокера;
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Касса) И ЗначениеЗаполнено(ЭтотОбъект.КассаПолучатель) Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.МеждуКассами;
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Касса) И НЕ ЗначениеЗаполнено(ЭтотОбъект.КассаПолучатель) Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.ИзКассыНаРасчетныйСчет;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ЭтотОбъект.Касса) И ЗначениеЗаполнено(ЭтотОбъект.КассаПолучатель) Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.СРасчетногоСчетаВКассу;
		
	ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект.Брокер) И Не ЗначениеЗаполнено(ЭтотОбъект.БрокерПолучатель) Тогда
		Возврат Перечисления.ВидыПереводовДенежныхСредств.МеждуРасчетнымиСчетами;
		
	Иначе
		Возврат Перечисления.ВидыПереводовДенежныхСредств.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции // ПолучитьВариантПереводаДенежныхСредств

Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	Если ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиДенежныхСредств");
		
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("Брокер",                       ЭтотОбъект.Брокер); 
		ЭлементБлокировкиДанных.УстановитьЗначение("МестоХранения",                ЭтотОбъект.МестоХранения);
		ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет",                ЭтотОбъект.РасчетныйСчет);
		
	ИначеЕсли ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваНаличные");
		
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("Касса",                        ЭтотОбъект.Касса);
		
	КонецЕсли;
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	ВариантПереводаДенежныхСредств = ПолучитьВариантПереводаДенежныхСредств();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОстаткиДенежныхСредств.Записывать   = Истина;
	Движения.ДенежныеСредстваНаличные.Записывать = Истина;
	Движения.РеестрПлатежей.Записывать           = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	Движения.ДенежныеСредстваПереданныеВОплатуПаев.Записывать = Истина;
	
	Если ЭтотОбъект.РасчетныйСчет.ТранзитныйПИФ Тогда
		
		// Реестр денежных средств переданных в оплату паев
		Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
			
			Движение = Движения.ДенежныеСредстваПереданныеВОплатуПаев.ДобавитьРасход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Пайщик                       = ЭтотОбъект.Основание.Пайщик;
			Движение.РасчетныйСчет                = ЭтотОбъект.РасчетныйСчет;
			Движение.Сумма                        = ЭтотОбъект.Сумма;
			
		КонецЕсли;
		
	Иначе
	
		// расход д/с
		Если ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
			Движение = Движения.ОстаткиДенежныхСредств.ДобавитьРасход();
			
			Движение.Период                         = ЭтотОбъект.Дата;
			Движение.Организация                    = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления   = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Брокер                         = ЭтотОбъект.Брокер;
			Движение.МестоХранения                  = ?(ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути, Справочники.МестаХранения.ВнебиржевойРынок, ЭтотОбъект.МестоХранения);
			Движение.РасчетныйСчет                  = ?(ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути, Справочники.БанковскиеСчета.ДенежныеСредстваВПути, ЭтотОбъект.РасчетныйСчет);
			Движение.Валюта                         = ЭтотОбъект.Валюта;
			Движение.Сумма                          = ЭтотОбъект.Сумма;
			Движение.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ПереводДенежныхСредств;
			Движение.ВариантДвиженияДенежныхСредств = ВариантПереводаДенежныхСредств;
			
		ИначеЕсли ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
			Движение = Движения.ДенежныеСредстваНаличные.ДобавитьРасход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Касса                        = ЭтотОбъект.Касса;
			Движение.Сумма                        = ЭтотОбъект.Сумма;
			
		КонецЕсли;
		
		// Задолженность перед пайщиком
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание)
			и ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")
			и ЭтотОбъект.РасчетныйСчетПолучатель.ТранзитныйПИФ Тогда
			
			Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Основание                    = ЭтотОбъект.Основание;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПередПайщиками;
			Движение.Контрагент                   = ЭтотОбъект.Основание.Пайщик;
			Движение.Валюта                       = ЭтотОбъект.Валюта;
			Движение.Сумма                        = ЭтотОбъект.Сумма;
			Движение.Аванс                        = Истина;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЭтотОбъект.РасчетныйСчетПолучатель.ТранзитныйПИФ Тогда
		
		// Реестр денежных средств переданных в оплату паев
		Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
			
			Движение = Движения.ДенежныеСредстваПереданныеВОплатуПаев.ДобавитьПриход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Пайщик                       = ЭтотОбъект.Основание.Пайщик;
			Движение.РасчетныйСчет                = ЭтотОбъект.РасчетныйСчетПолучатель;
			Движение.Сумма                        = ЭтотОбъект.Сумма;
			
		КонецЕсли;

	Иначе
	
		// даже если по брокеру не установлена детализация по р/счету, р/счет-получатель может быть заполнен (это нужно для печ. форм);
		// при этом такой р/счет не должен попадать в движения
		ДетализацияПоРасчетномуСчетуПолучатель =
			ЭтотОбъект.ДополнительныеСвойства.Свойство("ДетализацияПоРасчетномуСчетуПолучатель") И ЭтотОбъект.ДополнительныеСвойства.ДетализацияПоРасчетномуСчетуПолучатель;
			
		// приход д/с

		Если ЭтотОбъект.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Безналичная
			ИЛИ ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть Тогда
			Движение = Движения.ОстаткиДенежныхСредств.ДобавитьПриход();
			
			Движение.Период                         = ЭтотОбъект.Дата;
			Движение.Организация                    = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления   = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Валюта                         = ЭтотОбъект.Валюта;
			Движение.Сумма                          = ЭтотОбъект.Сумма;
			Движение.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ПереводДенежныхСредств;
			Движение.ВариантДвиженияДенежныхСредств = ВариантПереводаДенежныхСредств;
			
			Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть Тогда
				Движение.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок;
				Движение.РасчетныйСчет = Справочники.БанковскиеСчета.ДенежныеСредстваВПути;
			Иначе
				Движение.Брокер        = ЭтотОбъект.БрокерПолучатель;
				Движение.МестоХранения = ЭтотОбъект.МестоХраненияПолучатель;
				Движение.РасчетныйСчет = ?(ДетализацияПоРасчетномуСчетуПолучатель, ЭтотОбъект.РасчетныйСчетПолучатель, Справочники.БанковскиеСчета.ПустаяСсылка());
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Наличная Тогда
			Движение = Движения.ДенежныеСредстваНаличные.ДобавитьПриход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Касса                        = ЭтотОбъект.КассаПолучатель;
			Движение.Сумма                        = ЭтотОбъект.Сумма;
			
		КонецЕсли;
		
		// Задолженность перед пайщиком
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание)
			И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")
			И ЭтотОбъект.РасчетныйСчет.ТранзитныйПИФ Тогда
			
			Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Основание                    = ЭтотОбъект.Основание;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПередПайщиками;
			Движение.Контрагент                   = ЭтотОбъект.Основание.Пайщик;
			Движение.Валюта                       = ЭтотОбъект.Валюта;
			Движение.Сумма                        = ЭтотОбъект.Сумма;
			Движение.Аванс                        = Истина;
			
		КонецЕсли;

	КонецЕсли;
			
	Движения.Записать();
	
	Если      ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиДенежныхСредств(ЭтотОбъект, Отказ);
		Если ЭтотОбъект.РасчетныйСчет.ТранзитныйПИФ Тогда
			РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиДенежныхСредствПереданныхВОплатуПаев(ЭтотОбъект, Отказ);	
		КонецЕсли;
	ИначеЕсли ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиНаличныхДенежныхСредств(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	СтрокиБанковскойВыписки = Новый Массив();
	СтрокиБанковскойВыписки.Добавить(РегистрыСведений.РеестрПлатежей.СкомпоноватьСведенияОСтрокеБанковскойВыписки(	ЭтотОбъект.СтрокаБанковскойВыписки,
																													ЭтотОбъект.СтрокаБанковскойВыписки.ВидДвижения,
																													ЭтотОбъект.Сумма,
																													Перечисления.ВидыДвиженийДенежныхСредств.ПереводДенежныхСредств));
	
	// если  был перевод между собственными счетами и необходимо зарегистрировать и второе движение
	Если ЗначениеЗаполнено(ЭтотОбъект.СтрокаБанковскойВыпискиПолучатель) Тогда
		СтрокиБанковскойВыписки.Добавить(РегистрыСведений.РеестрПлатежей.СкомпоноватьСведенияОСтрокеБанковскойВыписки(	ЭтотОбъект.СтрокаБанковскойВыпискиПолучатель,
																														ЭтотОбъект.СтрокаБанковскойВыпискиПолучатель.ВидДвижения, 
																														ЭтотОбъект.Сумма, 
																														Перечисления.ВидыДвиженийДенежныхСредств.ПереводДенежныхСредств));
	КонецЕсли; 
	
	// реестр платежей
	РегистрыСведений.РеестрПлатежей.ЗарегистрироватьПлатеж(ЭтотОбъект,СтрокиБанковскойВыписки);
				
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	// Переводы между местами хранения одного брокера не формируют проводок, чтобы
	// не захламлять журнал оборотами по одному счету с одинаковыми субконто
	Если ЗначениеЗаполнено(ЭтотОбъект.Брокер) И ЭтотОбъект.Брокер = ЭтотОбъект.БрокерПолучатель Тогда
		Возврат;
	КонецЕсли;	
	
	СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	
	// Раньше использовался счет 20209, но в соответствии с 
	// "Разъяснения Банка России от 04.05.2017 
	// "По вопросам, связанным с применением Положения Банка России
	// от 02.09.2015 N 486-П "О Плане счетов бухгалтерского учета в 
	// некредитных финансовых организациях и порядке его применения" 
	//(далее - Положение N 486-П)""
	// 
	// пункт 17
	//
	// перешли на 47423 (ПланыСчетов.Единый.Расчеты23)
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Перевод денежных средств");
	
	// дебет	
	Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть Тогда
	
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
		
		Если ЭтотОбъект.БрокерПолучатель = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
			Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.РасчетныйСчетПолучатель.Банк.ЮрФизЛицо;
		Иначе
			Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.БрокерПолучатель.ЮрФизЛицо;
		КонецЕсли;
		
	Иначе
		
		Если ЭтотОбъект.БрокерПолучатель = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
			
			Если ЭтотОбъект.МестоХраненияПолучатель = Справочники.МестаХранения.ММВБ_ДепозитыСЦК Тогда
			    Проводка.СчетДт = ПланыСчетов.Единый.СчетаДляКлиринга24;
			Иначе
				БанкПолучательРезидент = Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчетПолучатель.Банк, ЭтотОбъект.Дата);
				
				Проводка.СчетДт = ?(БанкПолучательРезидент, ПланыСчетов.Единый.РасчетныеСчета01, ПланыСчетов.Единый.РасчетныеСчета02);
				
				Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчетПолучатель;
			КонецЕсли;
			
		Иначе
		
			Проводка.СчетДт = ПланыСчетов.Единый.РасчетыСБрокерами02;
			Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.БрокерПолучатель, ЭтотОбъект.Дата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Проводка.ВалютаДт  = ЭтотОбъект.Валюта;
	Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
	

	// кредит
	Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути Тогда
		
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты23;
		
		Если ЭтотОбъект.БрокерПолучатель = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.РасчетныйСчетПолучатель.Банк.ЮрФизЛицо;
		Иначе
			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.БрокерПолучатель.ЮрФизЛицо;
		КонецЕсли;
		
	Иначе
		
		Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
			
			Если ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ММВБ_ДепозитыСЦК Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.СчетаДляКлиринга24;
			Иначе
				БанкРезидент = Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк, ЭтотОбъект.Дата);
				
				Проводка.СчетКт = ?(БанкРезидент, ПланыСчетов.Единый.РасчетныеСчета01, ПланыСчетов.Единый.РасчетныеСчета02);
				
				Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
			КонецЕсли;
			
		Иначе
		
			Проводка.СчетКт = ПланыСчетов.Единый.РасчетыСБрокерами02;
			Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Проводка.ВалютаКт  = ЭтотОбъект.Валюта;
	Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;

	
	Если Проводка.СчетДт <> ПланыСчетов.Единый.Расчеты23 Тогда
	
		Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть
			ИЛИ ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути Тогда
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ДенежныеСредстваВПути;
		Иначе
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств;
		КонецЕсли;
	
	КонецЕсли;
	
	Если Проводка.СчетКт <> ПланыСчетов.Единый.Расчеты23 Тогда
	
		Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть
			ИЛИ ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути Тогда
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ДенежныеСредстваВПути;
		Иначе
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств;
		КонецЕсли;
	
	КонецЕсли;
	
	
	БухгалтерскийУчетЕПС.ПереоценитьВалютныеАктивы(ЭтотОбъект, Отказ);
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);	
	
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	// Переводы между местами хранения одного брокера не формируют проводок, чтобы
	// не захламлять журнал оборотами по одному счету с одинаковыми субконто
	Если ЗначениеЗаполнено(ЭтотОбъект.Брокер) И ЭтотОбъект.Брокер = ЭтотОбъект.БрокерПолучатель Тогда
		Возврат;
	КонецЕсли;	
	
	НастройкиУчетаОбщие  = БухгалтерскийУчет.ОпределитьНастройкиУчета(Дата, Организация, СчетДоверительногоУправления);
	
	СуммаВВалютеУчета   = РаботаСВалютами.ПолучитьСуммуДокументаВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.Валюта, ЭтотОбъект, Отказ);
	ЭтоВалютнаяПроводка = (ЭтотОбъект.Валюта <> ЭтотОбъект.Организация.ВалютаУчета);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаВВалютеУчета, "Перевод денежных средств");
		
	// дебет	
	Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть Тогда
		
		Если ЭтоВалютнаяПроводка Тогда
			Проводка.СчетДт = ПланыСчетов.Основной.ПереводыВПутиВВалюте;
		
			Проводка.ВалютаДт = ЭтотОбъект.Валюта;
			Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
					
		Иначе
			Проводка.СчетДт = ПланыСчетов.Основной.ПереводыВПути;
			
		КонецЕсли;

	Иначе
		
		Если ЭтотОбъект.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
			
			Если (Не ЗначениеЗаполнено(ЭтотОбъект.БрокерПолучатель)) И ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчетПолучатель) Тогда
				Если ЭтотОбъект.РасчетныйСчетПолучатель.ВидБанковскогоСчета = Перечисления.ВидыБанковскихСчетов.СчетЭскроу Тогда
					ЭтоСчетЭскроу = Истина;
				Иначе
					ЭтоСчетЭскроу = Ложь;
				КонецЕсли;	
			Иначе
				ЭтоСчетЭскроу = Ложь;
			КонецЕсли;	
			
			Если ЭтотОбъект.МестоХраненияПолучатель = Справочники.МестаХранения.ММВБ_ДепозитыСЦК Тогда
			    Проводка.СчетДт = БухгалтерскийУчет.ОпределитьНастройкуУчета(
					ЭтотОбъект.Дата,
					ЭтотОбъект.Организация,
					ЭтотОбъект.СчетДоверительногоУправления,
					"СчетУчетаДенежныхСредствНаБирже");
			ИначеЕсли ЭтоСчетЭскроу Тогда
				Проводка.СчетДт = ПланыСчетов.Основной.СчетаЭскроу;
			Иначе
				Проводка.СчетДт = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
					ЭтотОбъект.Дата,
					ЭтотОбъект.Организация,
					ЭтотОбъект.СчетДоверительногоУправления,
					ЭтотОбъект.Валюта,
					ЭтотОбъект.БрокерПолучатель);
			КонецЕсли;
				
			Если ЭтотОбъект.БрокерПолучатель = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
				Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда					
			    	Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчетПолучатель;
				КонецЕсли;	
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
				Проводка.СубконтоДт.БрокерскиеКомпании              = ЭтотОбъект.БрокерПолучатель;
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
				Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.БрокерПолучатель, ЭтотОбъект.Дата);
			КонецЕсли;
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
				Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть
					ИЛИ ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути Тогда
					Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ДенежныеСредстваВПути;
				Иначе
					Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств;
				КонецЕсли;
			КонецЕсли;
			
			Если Проводка.СчетДт.Валютный Тогда
			
				Проводка.ВалютаДт = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
							
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Наличная Тогда
			
			Если ЭтоВалютнаяПроводка Тогда
				Проводка.СчетДт = ПланыСчетов.Основной.КассаОрганизацииВал;
				
				Проводка.ВалютаДт = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
								
			Иначе
				Проводка.СчетДт = ПланыСчетов.Основной.КассаОрганизации;
				
			КонецЕсли;
				
		КонецЕсли;
				
	КонецЕсли;

	// кредит
	
	Если ЭтотОбъект.РасчетныйСчет.ТранзитныйПИФ И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
		Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
			Проводка.СубконтоКт.Контрагенты = РаботаСДокументами.ПолучитьКонтрагентаПоВидуПайщика(ЭтотОбъект.Основание.ВидПайщика, ЭтотОбъект.Основание.Владелец, ЭтотОбъект.Основание.Пайщик, Дата);  
		КонецЕсли;
		
		Если НастройкиУчетаОбщие.ВестиУчетИмуществаПайщиков Тогда
		
			ПроводкаПайщика = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаВВалютеУчета, "Перевод денежных средств");
			
			ПроводкаПайщика.СчетДт = ПланыСчетов.Основной.РасчетыКлиентаСПИФ;
			ПроводкаПайщика.СубконтоДт.Пайщики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "Пайщик");
			ПроводкаПайщика.СубконтоДт.ЗаявкиПайщиков = ЭтотОбъект.Основание;
			
			ПроводкаПайщика.СчетКт = ПланыСчетов.Основной.СредстваКлиента;
			ПроводкаПайщика.СубконтоКт.Пайщики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "Пайщик");
		
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути Тогда
	
		Если ЭтоВалютнаяПроводка Тогда
			Проводка.СчетКт = ПланыСчетов.Основной.ПереводыВПутиВВалюте;
			
			Проводка.ВалютаКт = ЭтотОбъект.Валюта;
			Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
					
		Иначе
			Проводка.СчетКт = ПланыСчетов.Основной.ПереводыВПути;
			
		КонецЕсли;
		
	Иначе
		
		Если ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
			
			Если (Не ЗначениеЗаполнено(ЭтотОбъект.БрокерПолучатель)) И ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчет) Тогда
				Если ЭтотОбъект.РасчетныйСчет.ВидБанковскогоСчета = Перечисления.ВидыБанковскихСчетов.СчетЭскроу Тогда
					ЭтоСчетЭскроу = Истина;
				Иначе
					ЭтоСчетЭскроу = Ложь;
				КонецЕсли;	
			Иначе
				ЭтоСчетЭскроу = Ложь;
			КонецЕсли;	
			
			Если ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ММВБ_ДепозитыСЦК Тогда
			    Проводка.СчетКт = БухгалтерскийУчет.ОпределитьНастройкуУчета(
					ЭтотОбъект.Дата,
					ЭтотОбъект.Организация,
					ЭтотОбъект.СчетДоверительногоУправления,
					"СчетУчетаДенежныхСредствНаБирже");
			ИначеЕсли ЭтоСчетЭскроу Тогда
				Проводка.СчетКт = ПланыСчетов.Основной.СчетаЭскроу;
			Иначе
				Проводка.СчетКт = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
					ЭтотОбъект.Дата,
					ЭтотОбъект.Организация,
					ЭтотОбъект.СчетДоверительногоУправления,
					ЭтотОбъект.Валюта,
					ЭтотОбъект.Брокер);
			КонецЕсли;
				
			Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
			 	   Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
				КонецЕсли;   
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
				Проводка.СубконтоКт.БрокерскиеКомпании              = ЭтотОбъект.Брокер;
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
			КонецЕсли;
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
				Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть
					ИЛИ ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути Тогда
					Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ДенежныеСредстваВПути;
				Иначе
					Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств;
				КонецЕсли;
			КонецЕсли;			
			
			Если Проводка.СчетКт.Валютный Тогда
			
				Проводка.ВалютаКт  = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
											
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
		
			Если ЭтоВалютнаяПроводка Тогда
				Проводка.СчетКт = ПланыСчетов.Основной.КассаОрганизацииВал;
				
				Проводка.ВалютаКт = ЭтотОбъект.Валюта;
				Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
								
			Иначе
				Проводка.СчетКт = ПланыСчетов.Основной.КассаОрганизации;
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	БухгалтерскийУчет.ПереоценитьВалютныеАктивы(ЭтотОбъект,УчетныйРегистр, Перечисления.ВидыУчета[УчетныйРегистр], НастройкиУчетаОбщие, Отказ);
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Ответственный, Дата, Номер, Комментарий, Проведен, ПометкаУдаления");
		ФормаДенежныхСредств 			= Перечисления.ФормыДенежныхСредств.Безналичная;
		ФормаДенежныхСредствПолучатель 	= Перечисления.ФормыДенежныхСредств.Безналичная;
		Основание						= ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Основание, Сумма, СтрокаБанковскойВыписки, СтрокаБанковскойВыпискиПолучатель");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть
		Или ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.Перевод Тогда
		
		Если ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
			ПроверяемыеРеквизиты.Добавить("Касса");
		ИначеЕсли ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
			ПроверяемыеРеквизиты.Добавить("МестоХранения");
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ЭтотОбъект.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Наличная Тогда
		ПроверяемыеРеквизиты.Добавить("КассаПолучатель");
	ИначеЕсли ЭтотОбъект.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
		ПроверяемыеРеквизиты.Добавить("МестоХраненияПолучатель");
	КонецЕсли;
	
	// У плательщика должны быть расходные выписки, у получателя - приходные
	
	Если ЗначениеЗаполнено(ЭтотОбъект.СтрокаБанковскойВыписки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СтрокаБанковскойВыписки, "ВидДвижения") <> Перечисления.ВидыДвижений.Расход
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для плательщика выбрана банковская выписка с видом движения 'Приход'", ЭтотОбъект.Ссылка,, "СтрокаБанковскойВыписки", Отказ); 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.СтрокаБанковскойВыпискиПолучатель)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СтрокаБанковскойВыпискиПолучатель, "ВидДвижения") <> Перечисления.ВидыДвижений.Приход
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для получателя выбрана банковская выписка с видом движения 'Расход'", ЭтотОбъект.Ссылка,, "СтрокаБанковскойВыпискиПолучатель", Отказ); 	
	КонецЕсли;	
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если РаботаСДокументами.ЗапрещенПрямойПереводНаСчетаБиржи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
					
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата);
		
		// основание может быть выбрано только по клиенту, являющемуся ПИФ
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание) И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") И ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления)
			И ТипЗнч(КлиентДоверительногоУправления) <> Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды")
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнено основание (заявка пайщика) для клиента, не являющегося ПИФ", ЭтотОбъект, "Основание",, Отказ);
		КонецЕсли;
		
		// Проверка на заполнение заявки пайщика
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Основание) И ТипЗнч(КлиентДоверительногоУправления) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды")
			И РасчетныйСчет.ТранзитныйПИФ
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перевод с транзитного счета ПИФ выполняется только по заявке пайщика", ЭтотОбъект, "Основание",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание) И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда 
						
			//Брокер исполнил поручения двумя переводами. Разовая заглушка.
			РазрешитьСозданиеДвухПереводовНаОснованииПоручения = (НачалоДня(ЭтотОбъект.Дата) = Дата(2022, 11, 17));
			
			РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "Дата, Проведен, СчетДоверительногоУправления, Брокер, БрокерПолучатель, РасчетныйСчет, РасчетныйСчетПолучатель, МестоХранения, Сумма, Валюта");
			
			Для Каждого Реквизит Из РеквизитыПоручения Цикл
				
				Если Реквизит.Ключ = "Проведен" Тогда 
			
					Если Не РеквизитыПоручения.Проведен Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать переводы на основании непроведенных поручений.", ЭтотОбъект, "Основание",, Отказ);	
					КонецЕсли;
					
				ИначеЕсли Реквизит.Ключ = "Дата" Тогда
					
					Если ЭтотОбъект.Дата < РеквизитыПоручения.Дата Тогда
					
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата перевода [" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + "] раньше даты поручения [" + Формат(РеквизитыПоручения.Дата, "ДФ=dd.MM.yyyy") + "].", ЭтотОбъект, "Основание",, Отказ);
						
					КонецЕсли;
						
				ИначеЕсли ЭтотОбъект[Реквизит.Ключ] <> Реквизит.Значение Тогда 
					//#321525 Проверка равенства значений реквизита "РасчетныйСчетПолучатель" осуществляется только для переводов в рублях,
					//т.к. переводы в валюте могут осуществляться через транзитные счета, о которых мы узнаем по факту совершенного перевода.
					Если (Реквизит.Ключ = "РасчетныйСчетПолучатель" И (ЭтотОбъект.Валюта <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль") Или ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть)) 
						Или Реквизит.Ключ = "Сумма" И РазрешитьСозданиеДвухПереводовНаОснованииПоручения
						//Если перевод из пути - расчетный счет откуда и место хранения не заполняются.
						Или ((Реквизит.Ключ = "РасчетныйСчет" Или Реквизит.Ключ = "МестоХранения") И ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути) Тогда
						
						Продолжить;
						
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе основания значение реквизита " + Реквизит.Ключ + " [" + Реквизит.Значение + "] отличется от значения документа [" + ЭтотОбъект[Реквизит.Ключ] + "]!", ЭтотОбъект, "Основание",, Отказ);		
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
						
			Запрос = Новый Запрос;
#Область ТЕКСТ_ЗАПРОСА
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВЫБОР
				|		КОГДА &РазрешитьСозданиеДвухПереводовНаОснованииПоручения
				|				И НАЧАЛОПЕРИОДА(ДокументПоручениеНаПеревод.Дата, ДЕНЬ) = ДАТАВРЕМЯ(2022, 11, 17)
				|			ТОГДА ЕСТЬNULL(ПереводыДенежныхСредств.СуммаПереводов, 0) + &СуммаПеревода > ДокументПоручениеНаПеревод.Сумма
				|					ИЛИ ЕСТЬNULL(ПереводыДенежныхСредств.Количество, 0) > 1
				|		ИНАЧЕ НЕ ПереводыДенежныхСредств.Количество ЕСТЬ NULL
				|	КОНЕЦ КАК ОшибкаСозданияПодчиненногоДокумента,
				|	ЕСТЬNULL(СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПорученийНаПереводДенежныхСредств.Исполнено), ЛОЖЬ) КАК ПоручениеИсполнено
				|ИЗ
				|	Документ.ПоручениеНаПереводДенежныхСредств КАК ДокументПоручениеНаПеревод
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств.СрезПоследних(&Период, ) КАК СтатусыПорученийНаПереводДенежныхСредствСрезПоследних
				|		ПО (СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств = ДокументПоручениеНаПеревод.Ссылка)
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СУММА(ПереводДенежныхСредств.Сумма) КАК СуммаПереводов,
				|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПереводДенежныхСредств.Ссылка) КАК Количество,
				|			ПереводДенежныхСредств.Основание КАК ОснованиеСсылка
				|		ИЗ
				|			Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
				|		ГДЕ
				|			ПереводДенежныхСредств.Проведен
				|			И ПереводДенежныхСредств.ВариантПеревода = &ВариантПеревода
				|			И ПереводДенежныхСредств.Ссылка <> &ЭтотОбъектСсылка
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ПереводДенежныхСредств.Основание) КАК ПереводыДенежныхСредств
				|		ПО ДокументПоручениеНаПеревод.Ссылка = ПереводыДенежныхСредств.ОснованиеСсылка
				|ГДЕ
				|	ДокументПоручениеНаПеревод.Ссылка = &ОснованиеСсылка";
#КонецОбласти
			Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
			Запрос.УстановитьПараметр("ЭтотОбъектСсылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ОснованиеСсылка", ЭтотОбъект.Основание);
			Запрос.УстановитьПараметр("РазрешитьСозданиеДвухПереводовНаОснованииПоручения", РазрешитьСозданиеДвухПереводовНаОснованииПоручения);	
			Запрос.УстановитьПараметр("СуммаПеревода", ЭтотОбъект.Сумма);
			Запрос.УстановитьПараметр("ВариантПеревода", ЭтотОбъект.ВариантПеревода); // на случай если поручение будет исполнено двумя переводами (через счет "В пути").
					
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ОшибкаСозданияПодчиненногоДокумента Тогда 
					Если РазрешитьСозданиеДвухПереводовНаОснованииПоручения Тогда 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перевод не будет проведен, т.к. общая сумма перевода(ов) созданных на основании поручения превышает сумму поручения.", ЭтотОбъект, "Основание",, Отказ);
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На основании поручения уже создан перевод денежных средств.", ЭтотОбъект, "Основание",, Отказ);
					КонецЕсли;
				КонецЕсли;
					
				Если ЗначениеЗаполнено(ЭтотОбъект.Брокер) И Не Выборка.ПоручениеИсполнено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Переводы можно создавать только на основании поручений (НТП) со статусом [ИСПОЛНЕНО].", ЭтотОбъект,,, Отказ);
				КонецЕсли;
													
			КонецЦикла;
					
		КонецЕсли;

		// контроль суммы перевода с транзитного счета для ПИФ по заявке пайщика
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание) И ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")
			И ТипЗнч(КлиентДоверительногоУправления) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды")
		Тогда
			МинимальнаяСуммаЗачисления = РаботаСДокументами.ПолучитьМинимальнуюСуммуЗачисленияПИФ(КлиентДоверительногоУправления, ЭтотОбъект.Дата);
			Если МинимальнаяСуммаЗачисления = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для ПИФ не определена минимальная сумма зачисления", ЭтотОбъект, "СчетДоверительногоУправления",, Отказ);
			ИначеЕсли ЭтотОбъект.Сумма < МинимальнаяСуммаЗачисления Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма перевода денежных средств с транзитного счета меньше минимальной суммы зачисления для ПИФ", ЭтотОбъект, "Сумма",, Отказ);
			КонецЕсли; 
		КонецЕсли;
		
		// перевод д/с между брокерами
		Если ЗначениеЗаполнено(ЭтотОбъект.Брокер) И ЗначениеЗаполнено(ЭтотОбъект.БрокерПолучатель) И ЭтотОбъект.Брокер <> ЭтотОбъект.БрокерПолучатель Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перевод денежных средств между различными брокерскими компаниями запрещен", ЭтотОбъект, "Брокер",, Отказ);
		КонецЕсли;
		
		// расчетный счет
		Если (ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.Перевод
					Или ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводВПуть)
				И ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная
		Тогда
		
			ДетализацияПоРасчетномуСчету =
				(ЭтотОбъект.МестоХранения <> Справочники.МестаХранения.ММВБ_ДепозитыСЦК)
					И РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(ЭтотОбъект);

			Если ДетализацияПоРасчетномуСчету Тогда
				Если Не ЗначениеЗаполнено(РасчетныйСчет) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Расчетный счет"" не заполнено", ЭтотОбъект, "РасчетныйСчет",, Отказ);
				Иначе
					Если ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.Валюта Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета отличается от валюты перевода", ЭтотОбъект, "РасчетныйСчет",, Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// расчетный счет получателя
		Если (ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.Перевод
					Или ЭтотОбъект.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.ПереводИзПути)
				И ЭтотОбъект.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Безналичная
		Тогда
		
			ДетализацияПоРасчетномуСчетуПолучатель =
				(ЭтотОбъект.МестоХраненияПолучатель <> Справочники.МестаХранения.ММВБ_ДепозитыСЦК)
					И РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(ЭтотОбъект, "БрокерПолучатель");
			
			// т.к. по просьбе Нади расчетный счет получателя в переводе отображается всегда,
			// сохраним необходимость его заполнения в доп. свойствах объекта,
			// чтобы использовать при получении плановых движений
			
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ДетализацияПоРасчетномуСчетуПолучатель", ДетализацияПоРасчетномуСчетуПолучатель);
			
			Если ДетализацияПоРасчетномуСчетуПолучатель Тогда
				Если Не ЗначениеЗаполнено(РасчетныйСчетПолучатель) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Расчетный счет получателя"" не заполнено", ЭтотОбъект, "РасчетныйСчетПолучатель",, Отказ);
				Иначе
					Если ЭтотОбъект.РасчетныйСчетПолучатель.Валюта <> ЭтотОбъект.Валюта Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета получателя отличается от валюты перевода", ЭтотОбъект, "РасчетныйСчетПолучатель",, Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная
			И ЭтотОбъект.Касса.ВалютаДенежныхСредств <> ЭтотОбъект.Валюта
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта кассы отличается от валюты перевода", ЭтотОбъект, "Касса",, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Наличная
			И ЭтотОбъект.КассаПолучатель.ВалютаДенежныхСредств <> ЭтотОбъект.Валюта
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта кассы получателя отличается от валюты перевода", ЭтотОбъект, "КассаПолучатель",, Отказ);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
		
	//Зафиксируем новый статус для поручения (основания)
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Брокер) И ЗначениеЗаполнено(ЭтотОбъект.Основание) 
		И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда

		УстановитьСтатусДокументуОснования();
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);	
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура УстановитьСтатусДокументуОснования()
	
	НовыйСтатус = Неопределено;
	
	Если ЭтотОбъект.Проведен Тогда
		
		НовыйСтатус = ?(ЗначениеЗаполнено(ЭтотОбъект.СтрокаБанковскойВыписки) Или ЗначениеЗаполнено(ЭтотОбъект.СтрокаБанковскойВыпискиПолучатель), 
						Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Исполнено, 
						Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Активно);	
						
	ИначеЕсли ЭтотОбъект.ПометкаУдаления Тогда //откатываем статус к исходному
		НовыйСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Активно;
	КонецЕсли;
		
	Если НовыйСтатус <> Неопределено Тогда
		
		ТекущийСтатус = РаботаСДокументами.ПолучитьТекущийСтатусПорученияНаПереводДенежныхСредств(ЭтотОбъект.Основание);
		
		Если ЭтотОбъект.ПометкаУдаления И ТекущийСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Отправлено Тогда
			Возврат;
		ИначеЕсли НовыйСтатус <> ТекущийСтатус Тогда
			РегистрыСведений.СтатусыПорученийНаПереводДенежныхСредств.УстановитьСтатусПоручения(ЭтотОбъект.Основание, НовыйСтатус);	
		КонецЕсли;
		
	КонецЕсли;
					 	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

#КонецОбласти
